app/controllers/votes_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
INSERT INTO "votes" ("topic_id", "updated_at", "created_at") VALUES(1, '2009-06-13 22:57:03', '2009-06-13 22:57:03')
---
  def create
    @topic = Topic.find(params[:topic_id])
    @vote = @topic.votes.create!